---
kind: other
id: Methods.T:Autodesk.Revit.DB.IPerformanceAdviserRule
source: html/7c2a3b8e-c8b8-9ddb-8779-7420bc2a5de1.htm
---
# IPerformanceAdviserRule Methods

Invoked by performance advisor for each element to be checked.